{
  "Is the background consistent across positions (spatially invariant within a well)?": {
    "yes": {
      "Are your image stacks time-series data?": {
        "yes": {
          "Does the background add to the signal (common in fluorescence imaging)?": {
            "yes": "Perform a model-free background correction. Specify the channel(s) of interest and indicate that you have time-series data. Estimate the frame range where the background is best defined (e.g., before cell arrival). Adjust the threshold carefully to exclude non-background objects. If background intensity fluctuates slightly across frames or positions, enable the optimization option. Since the background is additive, subtract it from the images.",
            "no": "Perform a model-free background correction. Specify the channel(s) of interest and indicate that you have time-series data. Estimate the frame range where the background is best defined (e.g., before cell arrival). Adjust the threshold carefully to exclude non-background objects. If background intensity fluctuates slightly across frames or positions, enable the optimization option. Since the background is not additive, divide the images by the background to express intensities relative to it."
          }
        },
        "no": {
          "Does the background add to the signal (common in fluorescence imaging)?": {
            "yes": "Perform a model-free background correction. Specify the channel(s) of interest and indicate that you are working with tiles. Adjust the threshold carefully to exclude non-background objects. If background intensity fluctuates across positions, enable the optimization option. Since the background is additive, subtract it from the images.",
            "no": "Perform a model-free background correction. Specify the channel(s) of interest and indicate that you are working with tiles. Adjust the threshold carefully to exclude non-background objects. If background intensity fluctuates across positions, enable the optimization option. Since the background is not additive, divide the images by the background to express intensities relative to it."
          }
        }
      }
    },
    "no": {
      "Is the background brighter at the center than at the edges?": {
        "yes": {
          "Is background correction critical for segmenting cells (common in traditional segmentation pipelines)?": {
            "yes": {
              "Does the background add to the signal (common in fluorescence imaging)?": {
                "yes": "Perform a model-based correction using a paraboloid model. Specify the channel(s) of interest and adjust the threshold to exclude non-background objects. Subtract the background from the images.",
                "no": "Perform a model-based correction using a paraboloid model. Specify the channel(s) of interest and adjust the threshold to exclude non-background objects. Divide the images by the background to express intensities relative to it."
              }
            },
            "no": "Skip preprocessing to save storage. Preprocessing can be performed on-the-fly in the measurement module. See <a href='https://celldetective.readthedocs.io/en/latest/measure.html#background-correction'>the documentation</a>."
          }
        },
        "no": {
          "Is the background a constant value?": {
            "yes": {
              "Is background correction critical for segmenting cells (common in traditional segmentation pipelines)?": {
                "yes": {
                  "Does the background add to the signal (common in fluorescence imaging)?": {
                    "yes": "Perform a model-based correction using a plane model. Specify the channel(s) of interest and adjust the threshold to exclude non-background objects. Subtract the background from the images.",
                    "no": "Perform a model-based correction using a plane model. Specify the channel(s) of interest and adjust the threshold to exclude non-background objects. Divide the images by the background to express intensities relative to it."
                  }
                },
                "no": "Skip preprocessing to save storage. Preprocessing can be performed on-the-fly in the measurement module. See <a href='https://celldetective.readthedocs.io/en/latest/measure.html#background-correction'>the documentation</a>."
              }
            },
            "no": "For complex background patterns, avoid correction at this stage. Use the local cell correction available in the measurement module. See <a href='https://celldetective.readthedocs.io/en/latest/measure.html#background-correction'>the documentation</a>."
          }
        }
      }
    }
  }
}
